forge/Misc/blog_transfer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>博客迁移记</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-01 17:13:42 CST"/>
<meta name="author" content="Menglong Tan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">博客迁移记</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 博客迁移 </a></li>
<li><a href="#sec-2">2 写博简史 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 博客迁移 </h2>
<div class="outline-text-2" id="text-1">

<p>半个月前，vps服务商发来邮件，说机房报告我的vps在攻击别人。大概看了下应该是被黑了，挂了木马。想着反正博客老是报503错误。为了一劳永逸，初步考虑把迁移博客迁移到github page。一直都是用emacs org-mode来写博客，也适合是用静态内容生成的方式。看了下github上<a href="https://github.com/mojombo/jekyll/">jekyll</a>等工具，都觉得不怎么顺手，就花了2小时用perl写了个把emacs org格式的文件生成博客的工具<a href="https://github.com/crackcell/orgblog-pl">orgblog-pl</a>。不过github生成页面的速度让我略不爽。最后把博客迁移到了<a href="http://sae.sina.com.cn/">sae</a>。目前一切顺利。
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 写博简史 </h2>
<div class="outline-text-2" id="text-2">

<p>06年的时候开始写博客，搬家了好几次，由于倒数据麻烦，每次搬家反而成了清洗劣质内容的过程。
</p><ul>
<li>
2006~2008：csdn，csdn的博客系统体验不好，当时老出问题
</li>
<li>
2008~2010：javaeye，在自己博客发招聘被封id，内容全丢了，发邮件给管理员没回应。不过客观来说je的博客体验不错
</li>
<li>
2010~2012：vps+独立域名
</li>
<li>
2012~现在：sina app engine+独立域名
</li>
</ul>

<p>真心希望，以后能不用折腾，多看点书，多写点博客
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Menglong Tan
<a href="mailto:tanmenglong AT gmail DOT com">&lt;tanmenglong AT gmail DOT com&gt;</a>
</p>
<p class="date"> Date: 2012-04-01 17:13:42 CST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
